data/movimiento.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZMM_CONSULTA_MOVIMIENTO>
         <FI_FECHA>
            <!--Zero or more repetitions:-->
            <item>
               <SIGN>I</SIGN>
               <OPTION>BT</OPTION>
               <LOW>2019-01-01</LOW>
               <HIGH>2019-04-01</HIGH>
            </item>
         </FI_FECHA>
      </urn:ZMM_CONSULTA_MOVIMIENTO>
   </soapenv:Body>
</soapenv:Envelope>